// გამოცხადებულიაცვლადებიnum1დაnum2.  num2-ისმნიშვნელობაგადაიყვანერიცხვითფორმატში.  num1დაnum2დაამრგვალეთმთელრიცხვამდე, 
// გაამრავლეთერთმანეთზე, შედეგიჩაწერეთr e su l tცვლადშიდაგამოიტანეთვებგვერდზეdocu me n t .w r i t e-ით.

// let num1 = 7.45
// let num2 = parseInt('13.56')

// let result = num1 * num2

// document.write(result.toFixed(0))



// მოცემულიგვაქვსრიცხვებიnum1დაnum2.  მათიჯამიჩაწერეთr e su l tცვლადში, Mat h.t oFi xe dმეთოდითდაამრგვალეთმეასედისიზუსტითდაგამოიტანეთეკრანზე.

// let num1 = 20.3
// let num2 = 27.2

// let result = num1 + num2

// document.write(result.toFixed(2))


// მოცემულიგვაქვსრიცხვიn u m.  ამოიღეთმისიკავდრატულიფესვი,დაამრგვალეთათეულისსიზუსტით,შედეგიჩაწერეთr e su l tცვლადშიდაგამოიტანეთკონსოლზე.

// let num = 77

// result = Math.sqrt(num)

// console.log(result.toFixed(1))


// მოცემულიგვაქვსრიცხვიn u m.  აიყვანეთმისიმნიშვნელობაკუბში, დაამრგვალეთასეულისსიზუსტით, შედეგიჩაწერეთr e su l tცვლადშიდაგამოიტანეთკონსოლზე.

// let num = 3.55
// let result = num**3

// console.log(result.toFixed(2))


// შექმენითფუნქციაi n f o,რომელსაცპარამეტრადგადაეცემასტრინგი. გადაცემულისტრინგიalert-ითგამოიტანეთეკრანზე. 

// function info () {
//    return "Some Info"
// }

// console.log(info())


// შექმენითფუნქციa exponentiation, რომელიცარგუმენტადმიიღებს2 რიცხვს, გამოინგარიშებსმნიშვნელობას:პირველირიცხვიხარისხადმეორერიცხვი, 
// შედეგსal e r t-ითგამოიტანსეკრანზედაასევედააბრუნებსმას. 


// function exponentiation(num1,num2) {
//     return num1**num2
// }

// console.log(exponentiation(2,4))


// შექმენითფუნქცია isEven, რომელიც არგუმენტად მიიღებს 1 რიცხვს, თუ ესრიცხვი ლუწია დააბრუნებს true-ს თუარა false-ს. მინიშნბა:
// კონსოლში წაეთამაშეთ ლუწ და კენტრიცხვებს, ნახეთრას გვაძლევს მათი ნაშთი(ოპერატორი%)  2-ზეგაყოფის შედეგად.

// function isEven (num) {
//    return num%2 === 0
// }

// console.log(isEven(4))


// შექმენით ფუნქცია,რომელსაც გადაეცემა ორი პარამეტრი: ერთი სტრინგ ტიპის და მეორე რიცხვითი ტიპის.
// ფუნქციამ უნდა დააბრუნოს პირველი პარამერტის შესაბამისი სტრინგის წინა ნაწილი, რომლის სიმბოლოების რაოდენობა მითითებულია მეორე პარამეტრში.


// function test (str,amnt) {
//     return result = str.slice(0,amnt)
// }

// console.log(test('arend', -2))



// Html გვერდშიმოცემულიგვაქვსპარაგრაფიინდექსით"my-Addr e ss":<pid="my-Address">მე ვცხოვრობ საქართველოში,
// შემდეგ მისამართზე:</p>შექმენითფუნქციაaddr e ss(addr ),რომელსაცპარამეტრადგადაეცემასტრინგი. ფუნქციაამსტრინგს
// i n n e r HT MLმეთოდითდაამატებს"my-Addr e ss"ინდექსისმქონეელემენტისშემცველობასახალხაზზე.  ფუნქციისშექმნისშემდეგმომხმარებელსpr ompt-ისსაშუალებითმოთხოვეთმისამართისშეყვანა,
// შემდეგგამოიძახეთფუნქციაaddr e ss, რომელსაცპარამეტრადგადაეცითესმისამართი.


// let Address = function(addr){
//     return  addr = prompt("Whats your name?");
// };

// document.getElementById('my-Address').value 

// document.write(Address())



// შევქმნათფუნქციარომელიცპარამეტრადგადაცემულორირიცხვისნამრავსდაამრგვალებსათეულამდე| ერთეულამდე| ასეულამდე.

// const nums = (num1 , num2) => num1 * num2

// console.log(nums(12.3,16.4).toFixed(0))
// console.log(nums(12.3,16.4).toFixed(1))
// console.log(nums(12.3,16.4).toFixed(2))


// შევქმნათფუნქციარომელიცპარამეტრადგადაცემულსტრინგსგაფილტრავსსიტყვა"HT ML"-ისმიხედვითდადააბრუნებსახალსტრინგს"HT ML"  სიტყვისგარაშე.

// function test (str) {
//     return result = str.replace('html', ' ');
// }

// console.log(test('html is the best'))




// შევქმნათფუნქციარომელიცპარამეტრადგადაცემულსტრინგსგაფილტრავსსიტყვა"HT ML"-ისმიხედვითდადააბრუნებსახალსტრინგს"HT ML"  სიტყვისგარაშე.

// const squared = num => num**2

// console.log(squared(20))